StructuralUsage Property
 Provides the primary structural usage of the instance, such as brace, girder etc.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public StructuralInstanceUsage StructuralUsage { get; set; }
  Visual Basic
Public Property StructuralUsage As StructuralInstanceUsage
	Get
	Set
  Visual C++
public:
property StructuralInstanceUsage StructuralUsage {
	StructuralInstanceUsage get ();
	void set (StructuralInstanceUsage value);
}
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →